app/Controllers/Category.php

SELECT *
FROM `categories`
ORDER BY `id` ASC
---
    public function index(){
        $catModel = new CategoryModel();
        $data['categories'] = $catModel->orderBy('id', 'ASC')->findAll();