app/Controllers/Transaction.php

SELECT *
FROM `depense`
ORDER BY `id` ASC
---
    public function index(){
        $transactModel = new TransactionModel();
        $data['depense'] = $transactModel->orderBy('id', 'ASC')->findAll();